In [1]:
#import required libraries

import numpy as np
import pandas as pd

In [2]:
# pass list as an arguments

first_series = pd.Series(list('abcdef'))

In [3]:
print first_series

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

Create Series from ndarray

In [4]:
np_country = np.array(['Luxembourg','Norway','Japan','Switzerland','United States','Qatar','Iceland','Sweden',
                       'Singapore','Denmark'])

In [5]:
s_country = pd.Series(np_country)

In [6]:
print s_country

0       Luxembourg
1           Norway
2            Japan
3      Switzerland
4    United States
5            Qatar
6          Iceland
7           Sweden
8        Singapore
9          Denmark
dtype: object

Creae Series from dict

In [8]:
#Evaluate countries and their corresponding gdp per capita and print them as series
dict_country_gdp = pd.Series([52056.01781,40258.80862,40034.85063,39578.07441,39170.41371,37958.23146,37691.02733,
                             36152.66676,34706.19047,33630.24604,33529.83052,30860.12808],index=['Luxembourg','Macao, China',
                             'Norway','Japan','Switzerland','Hong Kong','United States','Qatar','Iceland','Sweden',
                             'Singapore','Denmark'])

In [9]:
print dict_country_gdp

Luxembourg       52056.01781
Macao, China     40258.80862
Norway           40034.85063
Japan            39578.07441
Switzerland      39170.41371
Hong Kong        37958.23146
United States    37691.02733
Qatar            36152.66676
Iceland          34706.19047
Sweden           33630.24604
Singapore        33529.83052
Denmark          30860.12808
dtype: float64

Accessing Elements in Series

In [10]:
#access elements in the series
dict_country_gdp[0]

52056.01781

In [11]:
#access first 5 countries from the series
dict_country_gdp[0:5]

Luxembourg      52056.01781
Macao, China    40258.80862
Norway          40034.85063
Japan           39578.07441
Switzerland     39170.41371
dtype: float64

In [12]:
#look up a country by name or index
dict_country_gdp.loc['United States']

37691.02733

In [13]:
#look up by position
dict_country_gdp.iloc[0]

52056.01781

Vectorized Operations in Series

In [14]:
#Add the series
first_vector_series = pd.Series([1,2,3,4],index=['a','b','c','d'])
second_vector_series = pd.Series([10,20,30,40],index=['a','b','c','d'])

In [15]:
first_vector_series + second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

In [16]:
second_vector_series = pd.Series([10,20,30,40],index=['a','d','b','c'])

In [17]:
first_vector_series + second_vector_series

a    11
b    32
c    43
d    24
dtype: int64

Another Example

In [19]:
#now replace few indexes with new ones in second vector series
second_vector_series = pd.Series([10,20,30,40],index=['a','b','e','f'])

In [20]:
first_vector_series + second_vector_series

a    11.0
b    22.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

Create DataFrame from Lists

In [21]:
#last five olymnics data: place, year and number of countries participated
olympic_data_list = {'HostCity':['London','Beijing','Athens','Sydney','Atlanta'],
                    'Year':[2012,2008,2004,2000,1996],
                    'No. of Participating Countries':[205,204,201,200,197]}

In [22]:
df_olympic_data = pd.DataFrame(olympic_data_list)

In [23]:
df_olympic_data

  HostCity  No. of Participating Countries  Year
0   London                             205  2012
1  Beijing                             204  2008
2   Athens                             201  2004
3   Sydney                             200  2000
4  Atlanta                             197  1996

Create DataFrame from dict

In [24]:
olympic_data_dict = {'London':{2012:205},'Beijing':{2008:204}}

In [25]:
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)

In [26]:
df_olympic_data_dict

      Beijing  London
2008    204.0     NaN
2012      NaN   205.0

View DataFrame

In [27]:
#select by City name
df_olympic_data.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [28]:
#use describe function to display the content
df_olympic_data.describe

<bound method DataFrame.describe of   HostCity  No. of Participating Countries  Year
0   London                             205  2012
1  Beijing                             204  2008
2   Athens                             201  2004
3   Sydney                             200  2000
4  Atlanta                             197  1996>

Create DataFrame from dict of Series

In [29]:
olympic_series_participation = pd.Series([205,204,201,200,197],index =[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],index=[2012,2008,2004,2000,1996])

In [30]:
df_olympic_series = pd.DataFrame({'No. of Participatingf Countries':olympic_series_participation,
                                  'Host Cities':olympic_series_country})

In [31]:
df_olympic_series

     Host Cities  No. of Participatingf Countries
2012      London                              205
2008     Beijing                              204
2004      Athens                              201
2000      Sydney                              200
1996     Atlanta                              197

Create DataFrame from ndarray

In [32]:
np_array = np.array([2012,2008,2004,2000,1996])
dict_ndarray = {'year':np_array}

In [33]:
df_ndarray = pd.DataFrame(dict_ndarray)
df_ndarray

   year
0  2012
1  2008
2  2004
3  2000
4  1996

Create DataFrame from DataFrame

In [37]:
#create dataframe from a dataframe
df_from_df = pd.DataFrame(df_olympic_series)

In [38]:
df_from_df

     Host Cities  No. of Participatingf Countries
2012      London                              205
2008     Beijing                              204
2004      Athens                              201
2000      Sydney                              200
1996     Atlanta                              197